{
    "лекція 4 маніпуляція ч 1 .pdf": [
        {
            "text": "(Will be all the way you don't want) Manipulation turns into weapons the new millennium and the person has learn to distinguish this type of influence and counteract him so that not to the object in someone else's game. The origin of manipulation The word \"manipulation\", or “Manipulation”, leads to origin from the Latin word \"manipulare\" and in their The primary sense meant to \"manage\". Manipulation is -  Psychological impact on a person who is not always realized by it and forces her to act according to the goals of the manipulator;  a pinged process of creating an illusions by a subject of reality (or about yourself), which are perceived by other subjects (or the creator of illusions);  a special impact on a person's subconscious (mainly on his emotions, feelings and experiences) for the purpose of programming the motive of the partner to cooperate;  a kind of psychological impact whose skillful performance causes a hidden awakening of another person's intentions that do not"
        },
        {
            "text": "coincide with his topical  Supply insidious but outside decent and clean, sophisticated in ways implementation, usually a theatrical action of one person or group of people with intention to violate or destroy someone's interests for the sake of winning your own. List of reasons for manipulation 1 A person's conflict with himself (f Perlz). 2 Distrust of other people; inability to love (THERE ARE Froma). 3 Risk, feeling of absolute helplessness (J Bugental). 4 Fear of bodily interpersonal contacts (J. Haley, E. Berne, IN Glasser). 5 Uncritical desire to obtain approval of all and everyone (a Alice). 7 Clash of interests of social groups, struggle between influential try to strengthen their own power (sociologist m Chukas). Machiavellism is a personality quality characterized by a negative idea of communicative installation. Manipulative attitude - a personality trait that is expressed attitude to partner on interaction and communication not as a person with self -esteem, but Hidden"
        },
        {
            "text": "goals of the manipulator. Coercion, ignoring, destructive criticism, manipulation. Psychological protection is usually an unconscious process of elimination or weakening the human psyche of negative, traumatic or unacceptable emotional The main protection mechanisms include: objection, suppression, Regression, compensation, projection, substitution, intellectualization, jet learning. Suggestive influence or suggestion - the process of influence on the mental sphere of a person, associated with a decrease in awareness and criticality during influence and realization succumbed content. Neurolinguistic programming (NLP) - the direction of suggestive psychotherapy, aimed at changing human behavior by forming given programs in “Masked form” of verbal and non -verbal shape (representative system) Machiavelli wrote: “For a long time I haven't said what I believe in, never believe that I say, and if sometimes happens that I and really tell the truth, i wrap it like that It is a lie that it is"
        },
        {
            "text": "difficult to detect. \" Niccolo Machiavelli (1469-1527)-Italian thinker, philosopher, writer, politician, Author of military-theoretical works Machiavelli occupied in the Florence government several posts, most significant of which is the Secretary of the Second Office that She was responsible for the diplomatic relations of the republic. Types of manipulation Manipulation of love \"If you love, then ...\" As a kid you could say, “If you \"Listen to me.\" Girl to the guy: “If you loved me, then would not spend so much time with friends but was A friendly team so rarely who leaves from ours the team on their own will ” The person has a priori They love, I don't have to go anywhere. \" Fear manipulation “You will behave badly - will take away his uncle police officer \",\" you will learn badly - you will become janitor \",\" won't do it - I will go \"…… infarct\" Although, in fact, it implies, “I do a lot more than you deserve, and I am waiting for a reward for that. \" Manipulation of a sense of"
        },
        {
            "text": "pity controlled, steps were not allowed to make Manipulation: The guy sympathizes with a difficult the child of his girlfriend, pity her and in everything childhood emotionally brings partners closer You Start sparing the manipulator and doing Everything to correct his such condition. Manipulation of guilt actually meant: “I lazy to wash dishes, but it is uncomfortable to ask you about it. \" “With a girlfriend drank while I'm here one hungry with the kids sat? ” Although it actually implies: “I have the right to behave today as you like and you don't even dare me something Manipulation of self -doubt Your Mch says, “You're going to eat on Play ” Although actually wants to say, “I to do something you don't like, and not I will be guilty. \" a normal man, for a long time would be alone \"Remember your place - you are nobody.\" Manipulation of a sense of pride At work they say, “We know that you are - Perspective employee We are in you raising, however, with preserving Principles of"
        },
        {
            "text": "manipulation (according to R. Chaldini): 1. Rules the sequences 2. Principle of mutual exchange 3. Principle of social evidence 4. Principle of attractiveness 5. Principle of influence of authority 6. The principle of deficiency by people Studies the \"psychology of compassion\", Considering interesting cases from your own practice, Bested by scientific research Find out stereotypical behavior, ways of manipulation and other “tools of influence” on people Conclusions the experiments delivered by his students, Practical value. Experimental social Psychologist from the United States The principle of mutual exchange The essence of this phenomenon is that we seek thank those people who helped us That is when man does us a favor (even if we are not asked), then the probability that we will agree to help to this person when he or she goes to us for help, is growing significantly. The principle of social evidence Whatever independent we are, we still belong to certain groups of people-people,"
        },
        {
            "text": "family, class, fan club, party, church Some Psychologists argue that belonging to the community is The natural need of each of us And when a person learns that others People do in a certain way, then they are inclined to the same choice. This principle is very popular in advertising “2 million people already became participants in our loyalty program ” Remember how people They rushed to mmm There were also many depositors there. Fear of loneliness We are afraid of loneliness A lonely person feels defenseless, No one needs Hence the need for family, friends, like -minded people. Hence - sympathy for orphans, to those who \"no one\". We treat our countrymen better, people of their race and nationality, specialty, single religion Fearing fall out of community, groups we belong to, we try \"not This is cleverly used by the manipulators. Test white and black pyramid The English newspapers reported a concert of silence that gave one Once some unknown pianist A loud advertisement has done its"
        },
        {
            "text": "business - in The day of the concert hall was full Virtuoso of silence, sat down for a piano and played but, but, Since all the strings were removed, no sound sounded People in the hall began to look at each other Everyone was waiting for a neighbor and, in as a result, the whole audience was sitting, holding a breath After two hours grave silence concert is over Pianist got up and bowed Its carried out stormy applause The next day virtuoso silence told this story on television and in graduation confessed: \"I wanted See how far the human stupidity stretches: it is boundless. \" In the words of this \"pianist\" there is one inaccuracy He collided with no stupidity, but with conformism This is called the psychological phenomenon of dependence a group participant from general opinion Blaz Pascal noted: \"Public Thought rules people ” Need to gain a great courage so that express the opinion first, as it happened in the famous tale of Andersen \"New King's outfit \":\" And the king is naked! \" N"
        },
        {
            "text": "Kuchevsky writes: \"It has long been established that under the pressure of a random group, For example, a third of its members change their minds and do not try it to defend it when it does not coincide with the estimates of others, ie manifest Conformism ... Defending our opinion, we accept on ourselves responsibility for its correctness Surprising Common opinion - we take away responsibility. Everyone understands the stories from school childhood, Similar to this. Torn lesson, the whole class from him escaped There is a parsing of the event. Head: \"Ivanov, why did you go from the lesson?!\" Ivanov: \"Everyone went and I left.\" The principle of attractiveness We tend to make concessions to famous personalities and those to whom we are We are good Stars get crazy money for what in The commercial will be told how they like mayonnaise, car, or drink of a particular company James Bond advertises Watches and cars Football stars with great pleasure advertise Pepsi despite the fact that the"
        },
        {
            "text": "impact of this drink on health consumers, to put it mildly, doubtful. \"I am for a healthy diet, I don't drink circles but! Ronaldo will greatly sly, Circles, and advertise \"healthy\" Kfs? The principle of influence of authority People tend to trust the titles and titles that sometimes create an image of expertise So be careful when you make a decision under influence unknown to you the “specialist” Man in white The robe is not always a doctor. The rule of sequence Conducting the contest “Write for what, you love our products and win prize ” (And if we wrote a letter about how We love the sour cream of the company \"cream sour cream\" then what sour cream we We buy when we will be in the supermarket?) Flash Mob: On the page of his profile a person announces that for some time will reach results in a particular industry This is called \"declaration\" Not tax Typically this is some considerable amount The principle of scarcity “The offer is limited We have released only one thousand such"
        },
        {
            "text": "brands (cars, watches) » When we have scarce thing, we feel pretty prestigious, we feel ourselves Elected The price of things sold from auctions sometimes reaches hundreds of millions of dollars But what is the true value? The principle of intangible things deficit"
        }
    ],
    "лекція 4 маніпуляція ч 2 .pdf": [
        {
            "text": "Suggestics techniques in language manipulation: - the softness and power of voice - The wealth of intonations - Pause - the high pace of language The ability to purposefully influence a person, his emotions with the help of certain words and phrases are known from antiquity Some of them are capable of causing Only certain emotions, but also subconsciously perceive in the form of psychological images. While communicating with a large audience, a more winning position will take the person to use the male voice, especially low, Models of manipulative communication: • precaution type (desire to please others, frequent apology, criticism about yourself); • the accusative type (constant search for the perpetrator, bold behavior with a rude desire to conquer authority by fear, master of the situation); • a prudent type (correct, calm, conducts calculation • Remote type (does not respond to a question, says It is inappropriate, not time, unreasonable). • Balanced type (harmonious, calm,"
        },
        {
            "text": "Inherent assertive behavior These are holistic self -actualized personalities). Methods of language manipulations:  substitution of concepts  Comparison in favor of the manipulator  Implantable rating The linguistic fastening The merciful choice Retorical question  Declaration of the subject of action  substitution of neutral concepts emotionally-evaluated Correbles and vice versa The turnover of concepts Proma analogy Conuction of negative particles \"no\" or \"no\"  Illusion of choice “Buy Economic / Budget Phone” - Instead of the word - cheap; \"In the Barm\", \"In Firewood\", \"In Zuzu\", \"In Drabadan\" - instead of a strong alcohol intoxication; “Fifth Point”, “soft place” - instead of priest or “Available Woman”, “Light Behavior Woman” - Instead - a prostitute Substitution of concepts The concept known to us is put in one series with negative / positive concepts, resulting in a negative / positive meaning In doing so straight nothing The man says he himself does the work on"
        },
        {
            "text": "negativization / positiveization of meaning. Examples of Calve Mayonnaise Advertising - Women have their secrets (Mayonnaise becomes female ... has passed another crazy, crowded with events, day The evening leaves quietly My house A flew butterfly tap on a lamp lamp A weak evening coffee. A lightened cigarette In the morning we will meet again: sun, coffee, \"Variante\", I and happiness. (In advertising ownership of elite Finnish cuisine \"Variante\" is compared by value with happiness and sunlight.) Ten Euphemisms used by Russia: \"Special Military Operation\" - war; “Liberation” - occupation; \"Rigid planting\" - a fall of the rifle; \"Cardinal reduction of the offensive\" - ​​indentation; \"Negative economic growth\" - fall in the economy; \"Negative information\" - losses of Russian troops; \"Kap\" - explosion; \"Pshik\" - \"cotton\"; \"Smoke\" - fire; \"Release\" - dismissal. Comparison in favor The reception is to search the object, which one could rely on to The product looked in the winning light."
        },
        {
            "text": "Thus appear in advertising phrases like “it's a regular laundry powder, which is Ariel ” Examples with the human brain .. and just brought to smarter than a person) The obvious and all known fact, the event, Convenient manipulator Everything looks like new Familiarity with the subject Example with advertising: expectations, and new dating, unexpected plans for the evening ” (Announcement in the lobby of the hotel robbed the Ai-Ji-Ay shop, on the radio was immediately stated: “Even robbers prefer to deal with our store, not with any other! ”. Implanted evaluation Implature is a way to transmit information When it is open text in the message not present but with the need is pulled by the reader in The power of stereotypes of thinking. “You will be taught to use cosmetics properly, beautiful, stays even more beautiful than by Mary Kay's cosmetics). “A car that will help you bring you trust to cars ” (Hidden Information: You lost remedy the situation) Cobra in You are you (Hidden"
        },
        {
            "text": "Information: You are and so dangerous) False choice (What color of \"Marsians\"?) Who said about color - agrees with their existence. Everett Shostr is highlighted types Dictator Manipulator (Gruban) • Calculator manipulator (calculator) • Manipulator-Highway • stuck (ivy) • Manipulator • manipulator-defender • Glorious guy • Huligan manipulator Manipulation is one of five types of interpersonal Relationships By virtue of circumstances and a particular situation, every Type of relationship (including manipulation) may be manifested as positive and negative. 1) Manipulation as a means of self -affirmation of teachers at the expense infringement of students' personality, 2) manipulation as a way to increase the efficiency of educational- educational process by activating educational and moral- Behavioral actions of students. • Using a system of denunciations • Using your pet system • Creating an atmosphere of unknown • humiliation • Assessment as a punishment • disappointing comparisons E."
        },
        {
            "text": "Shostrom gives an interesting one Teachers' manipulation classification. He identifies the following techniques: Examples of manipulations that teachers resort to: 1 Freedom in assessing students' knowledge, arbitrary establishment of exam requirements, threats to punish a student at the end of the semester for breach of certain requirements, etc. p.; The teacher responds so that students reflect the desire to ask questions); 3 Condescending teacher (this approach makes the teacher's life more calmer); 4 Manipulation of \"go to the dean\" (system of denunciations for bad students); 5 The system of pets (privileged position of some students); 6 Humiliation (\"heavy\" student is ridiculed in front of the group); 7 Punishment by grades (a bad grade or “H” is put); 8 Manipulation of \"status\" (I know more, sit and listen quietly); 9 Manipulation of “knowledge of the subject” (use of words-professionalism without A clear explanation of their importance or replacement by Ukrainian"
        },
        {
            "text": "correspondences). Using manipulation traps in the student -teacher system Take a plot The last credit Leg in the door When exposed to teachers, students use: 1 Personal qualities of the teacher (to cause sympathy); 2 The teacher's need for self -affirmation and in positive emotions (to support conversation on the topic interesting for the teacher); 3.The teacher's capacity to resist psychological pressure (to put pressure on teacher student group, last credit, scholarship); 4 The teacher's conformism (to resort to the mediation assistance of relatives); 5 Professional installations of teachers (to be interested in the subject); 6 Selfish desires of the teacher (make a hint of bribe or gift); 7 Pushing a teacher with a dean (to say that the teacher puts forward unbearable requirements); 8 Disease (frequent visits to the medical cabinet); 9 Flattery and compliments (\"You are the best teacher of all I know\"); 10 Pushing one teacher with another (\"Here in the class of Mr. .. fun \"); 11"
        },
        {
            "text": "Promises of good learning and correct in the next semester. 1 The solution needs to put it in third place He has in front of him be two short simple positive questions to which answers should be \"yes\". 3. Auditness of arguments largely depends on the image and the status of persuasive. 4.Do not humiliate the status, do not disregard the interlocutor. condescending, and the arguments of the unpleasant - with bias. 6. Suggest someone to persuade - you need to start with not separating moments, and with what the interlocutor will agree immediately. 7. Performing empathy. 8.The tutorial of conflicts. 9.Mimics, gestures, poses - must confirm the words. 10.Poe that the proposed will satisfy one of the needs Ten rules of belief: Methods of neutralizing techniques of psychological manipulation: - Protecting the type of \"dots above I\" - Passive protection \"past ears\" - countermanipulation Countermanipulatory tactics: - skills of confident behavior - The technique of changing the topic of"
        },
        {
            "text": "conversation - Technique interruption of contact Assertive behavior Methods of neutralization of manipulation If you think you No one manipulates - so you in the hands of professionals As sometimes \"read\" thoughts The need for subordinates in one's own security allows Dictators are easy to \"guess their desires.\" In Stalin's time, there was a practice of inviting outstanding artists to speak before the leader and his the closest environment After listening to the speech Kozlovsky, listeners began to argue what to order Sing yet They were interrupted by Stalin: “What are you, comrades, can't We must ask the artist to do what he wants And I want Kozlovsky's friend to perform \"I will remember the wonderful Management psychology In the peak of the heyday of the Baikonur cosmondrome began to arrive so much cargo on him Highway coming from the nearest station had to install a barrier Written ad: \"I urgently requires another moving Salary is something ” Hanged announcement in the parish"
        },
        {
            "text": "village but since the payment was small and from The work itself did not vague any significance, locals ignored it. No one came to the personnel department all month Then a new one appeared in the village ad: \"Required chief of the barrier\" In the morning in the personnel department was Collaboration ... Thus been given the opportunity to realize themselves in the desired one for Management of direction The same is the techniques used Generalisimus Suvorov Here is one of them. Norebranian Shapkin during the battle was frightened and hid in the bush Suvorov saw that, but did not punish him approximately [as it was accepted], but did otherwise Rewarding those who distinguished in battle he handed the medal and an extremely confused hatch Not Having survived the inquiries of comrades, for which the award came to Suvorov and turned the medal Suvorov medal accepted, saying that it only takes it on temporary storage In the next battle, Shapkin showed miracles of heroism Yes Suvorov raised"
        },
        {
            "text": "his (as he called them) \"miracle-sights\" This technique is Let's call \"medal on growth\" Happened to a man like a hero and she will try To become In essence, the same technique used a prison chief for especially hazardous criminals in New York He managed to work there a lot years without allowing the excesses that this prison was sad to him Here His principle: \"I treat them like decent people They and behave The great German poet Goethe accurately formulated this phenomenon with the words: \"If we accept people as they are, we make them worse If we treat them as if they are as they are they should be we help them become as they are able to When studying school teachers, it turned out that when they are many expect from their students, then one of this is enough to cause The increase in intelligence ratio by 25 points. Abraham Lincoln, 16th President of the United States, who initiated the law on abolition of slavery, formulated this idea very briefly: \"Drops You catch honey more flies"
        },
        {
            "text": "than a gallon of poison. \" Interesting role of positive emotions in the conditions of sports struggle They Increase the self -esteem of the athlete and his confidence in their abilities. Once looking at the football players' workouts, a leather ball star Pele said he knows why they are not so successful on International arena Their workouts are devoted to eliminating the shortcomings, and it is necessary Develop strong durability According to this football player, he and his Comrades a lot of shortcomings but few people notice them because they have what they have turns out the best they can do perfectly and those disadvantages that Remain - only the continuation of their abilities and skills."
        }
    ],
    "Лекція 6.3. Біном Ньютона. Задача про цілочислові розв’язки. .pdf": [
        {
            "text": "Lecture 6 Theme 3 Combinatorial analysis Basic rules of combinatorial analysis Placement, connection and permutation. Bina Newton The task of integral solutions Generation of combinatorial objects Bina Newton The task of integral solutions The task of integral solutions The numbers of the second kind and the numbers of Bella Consider the problem of calculating the number of cuts of the set A to the immigrant parts."
        }
    ],
    "Лекція 6.1. Основні правила комбінаторного аналізу..pdf": [
        {
            "text": "Lecture 6 Theme 3 Combinatorial analysis Basic rules of combinatorial analysis. Placement, combination and permutation Bina Newton The task of integral solutions Generation of combinatorial objects Let's start with the wording Rules of product. Example The bookstore has 15 different books in discrete mathematics and 10 different books with mathematical analysis How much way a student can make a purchase to have two Different books from each discipline? According to the rule of the product 15 × 10 = 150."
        }
    ],
    "Лекція 6.2. Розміщення, сполучення та перестановки.pdf": [
        {
            "text": "Lecture 6 Theme 3 Combinatorial analysis Basic rules of combinatorial analysis. Placement, combination and permutation Bina Newton The task of integral solutions Generation of combinatorial objects Calculating the number of placements and connections choice opportunities Using the product rule, we make sure that equality (1) Function 𝜑-Biectation (mutual and single reflection) Equality (4) has been proven. Repetition permutations"
        }
    ],
    "Лекція 6.4. Генерування комбінаторних об’єктів.  перестановок..pdf": [
        {
            "text": "Lecture 6 Theme 3 Combinatorial analysis Basic rules of combinatorial analysis Placement, combination and permutation Bina Newton The task of integral solutions Generation of combinatorial objects Generation of combinatorial objects Generation of permutations B1B2… bn is called lexicographic next to A1a2… an, if not There is such a permutation C1C2… CN that A1A2… an <C1C2… CN and C1C2… CN <B1B2… BN. The algorithm for building lexicographically next permutation by permutation A1a2… an Step 1 Find such numbers AJ and AJ+1 such that (aj <aj+1) ∧ (aj+1> aj+2>…> an) It means that you need to find in the rearrangement the first thing is a couple of adjacent numbers, in which number that on the left, less than the number that is right. Step 2 Write in j-th position is the least of the numbers Aj+1, AJ+2,…, an at the same time more than AJ. Step 3 Write in ascending order the number AJ and the rest of the numbers aj+1, aj+2,…, an in position j+1, , n. Justification of the algorithm."
        }
    ]
}