{
    "Лекція 3. Визначники..pdf": [
        {
            "text": "Lecture 3 Definition of the NI order determinant A permutation of n numbers or n elements is called the set n first natural numbers recorded in a certain order Rearment with P. Numbers in general form as follows: In this entry each of means one of the numbers , and none of the numbers It occurs twice. The transposition is called a re -re -transformation in which some Two of its elements change places, and the rest of the elements remain fixed. For example, as a result of transposition of elements 6 and 4 in a permutation (1, 6, 2, 5, 4, 3) Let's get a permutation (1, 4, 2, 5, 6, 3). Let  , 2 - arbitrary, but fixed rearrangement with P characters They say that in the rearrangement  , 2 elements (numbers) form an inversion if L  but KL stands in this permutation to the left of SL. For example, in a permutation (1, 5, 2, 4, 3) elements 5 and 4, or 5 and 2, or 5 and 3, or 4 and 3 form inversion, and elements 1 and 3 inversions do not form. Paired is called a permutation if the number of"
        },
        {
            "text": "inversions formed by it Elements, paired, and odd if the number of inversions formed is odd. For example, permutation (7, 5, 4, 6, 1, 2, 3) paired because its elements form 16 inversions (check!), and permutation (2, 1, 3, 6, 4, 5, 7) odd because its items form 3 inversions. Set A is considered mutually uniquely reflected in the set B, If each item by any rule put in matching one and only one item , and any two different the plural elements A correspond to two different elements of the set B and each The item A element is appropriate at least for one plural element B. Let M be the set of first n positive integers: Substitution of a plural m or substitution of nth degree is called any mutually unambiguous display of the plural yourself If When substitution  number  is displayed in a number ia then record ie under each of the numbers sign the number in which it is displayed and these two lines take into brackets This entry should be read as follows: In the substitution  1 goes into"
        },
        {
            "text": "1a, 2 goes into 2a, and t d., n goes in Since substitution is a mutually unambiguous reflection then all numbers different, and therefore the second line of this record is some permutation of items Paired is called a substitution if the parity of the upper and lower permutation of arbitrary recording coincide and odd if the parity of these The permutation is opposite Or: paired is called substitution if the total Number of inversions in the upper and lower permutations of arbitrary recording, even, in Otherwise, it is called odd. Remark Both definitions are equivalent. Example Determine the parity of the 6th degree substitution  In the upper permutation of this record there are 5 inversions, and at the bottom of them 11. The total number of inversions in both rearrangements is 16 So the substitution is paired. Let's write this substitution now by placing the elements of the top permutations in order of growth; Clearly, keeping in conformity: In the upper permutation of this entry 0"
        },
        {
            "text": "inversions and in the lower one - 8 of them General The number of inversions is 8, therefore, the substitution is paired. This example shows that with different records of this substitution parity the total number of inversions in both permutations is stored, namely the number In general, it changes  Consistent application of two substitutions leads to a substitution that It is called their product. 4) ∗ (1 The determinant (determinant) of the nth order is written in the following form: a is an element of this determinant located at the intersection of the i-th line, j- The column, and The set of elements  The determinant is called the i -th row of the determinant; And the set of elements k - a column of the determinant The number of rows (columns) of the determinant It is called its order. The diagonal of the determinant going from the left upper to the right lower angle, ie formed by the elements , called the main diagonal; the diagonal of the determinant going from the left lower"
        },
        {
            "text": "to the right upper corner, That is, formed by elements It is called a side diagonal. The determinant (determinant) of the nth order is called an expression that is equal to Algebraic amount n! members who are all possible works of elements of this the determinant taken one of his line and each column, and The member is taken with a plus sign if the indices of its elements form a paired substitution, otherwise with a minus sign, ie , ..., α - the number of inversions in the permutation  of the numbers And the summation is conducted on all n! permutations from n numbers. Remark This definition is universal as it involves an arbitrary the nature of the elements of the determinant (eg, functions, trigonometric expressions and others) If the elements of the determinant are exclusively the number, then the determinant is the number. We get a second -order determinant that looks like this and is equal by the definition of the difference of the products of the elements of the main and Side"
        },
        {
            "text": "diagonals, that is Example Calculate the determinant:  by formula 3 Let's get: We get a third -order determinant that looks like this and is by the definition of formula: The rule of calculation of the determinant of the third the order is called the triangle rule because This formula can be obtained using that Example Calculate the determinant That is  = Basic properties of determinants The transposition of the determinant is called its transformation, when Which rows of this determinant are columns with the same numbers. The determinant obtained as a result of transposition is called transposed and denote  If 1 The determinant does not change when transposed. This property confirms the equality of rows and columns of the determinant: any statement of the determinant lines whose correctness is proven, It is also fair for its columns. 2 If any of the lines of the determinant is zero (ie consists of zeros), then the determinant is zero. 3 If the determinant is changed in places any"
        },
        {
            "text": "two lines then absolute The value of the determinant will not change, and the sign will change to the opposite. 4 The determinant in which there are two identical lines is zero. 5 If all the elements of one of the lines of the determinant multiply by some The number , then the determinant will multiply by . This property can be formulated as follows: a common factor All the elements of any line of the determinant can be carried out as a sign of the determinant. Two lines of the determinant are called proportional if one of them We get the multiplication of another by some number. 6 The determinant who has two proportional lines is zero. 7 If each element of the i-th row of determinant is the sum of two additions , 1 n j  then the determinant is equal to the sum of two determinants in which all lines except the i-th, are the same as that of a given determinant and the I-th row is in the first determinant from the elements ijb, and in the second - from the elements IJC: 8 If one of"
        },
        {
            "text": "the lines of the determinant is a linear combination of other it rows, then the determinant is zero. 9 If we add another line to one of the determinants of the determinant, Multiple by some number , then the determinant will not change. The number  can, of course, be negative, so the property 9 follows, that the determinant does not change and when one line is subjected to one line from another, multiplied by some Repeated Properties 9 Easy prove that the determinant will not change if one of his lines add any What is the linear combination of other lines. The use of properties of the determinant greatly simplifies its calculation. For example, in the determinant can be taken out for the sign determinant number (–456123), then it will be written 456123  , in this form can be counted and verbally Schedule of the determinant by the elements of a row or column Minor of the element The nth order determinant is called determinant  -h order received from the initial determinant by"
        },
        {
            "text": "crossing the i-th row and j-th column (ie row and column, at the intersection which the item stands) and denoted M Algebraic addition is called his minor taken with his sign if i  even, and with the opposite sign, if odd, ie Theorem The determinant is equal to the sum of the products of all the elements of any it row or column on their algebraic additions: The formula (7) is called the determinant of the I-th Line Elements, and The formula (8) is the schedule of the determinant by the elements of the j-th column. For example, we will lay out the third order determinant by the elements First Line: Methods for calculating determinants Gauss method Let u define  element different from zero, let's call it Leading element If before the i-th line, i , we will add S-ti line multiplied to some number , then the determinant will not change that Take it and we will add S-th row multiplied by , to each row except SI We get the determinant , in which all elements of k-th column except the"
        },
        {
            "text": "leading item , will be zero Having spread determinant  by the elements of the k-th column, we get equality And, like that way, let's calculate the deterler of the nth order  to the calculation of the minor M (determinant of order ) With a minor M do the same and t d Yes Act until we get a record of the determinant  in the form of a product of two numbers This method of calculating the determinant is called the Gauss method. Note 1 Instead of adding a s-th row multiplied by , to I-th line  and the decomposition of the determinant by the elements of k-th column can be added a k-th column multiplied by , to the j-th column  and then lay out the determinant  by the elements of s- th row. Remark 2 Leading element a it is advisable to choose in that column (a line) that contains many zeros, for the presenter is better to take an item that is equal to 1 because in this case the factors According to the numbers Example Calculate the determinant Haus method.  Let's take the presenter 31"
        },
        {
            "text": " To the first line we will add the third, Multiple by –1, and to the second we will add the third, multiplied by 2, we will get: By spreading this determinant by the elements of the first column, we will have In Minor M for the leading item we will take 33  We will add to the first line the third, multiplied by 3, and from the second - we will subtract the third, we will get By spreading this determinant by the elements of the third column, we will have The method of reducing the determinant to a triangular look The determinant is triangular if all of its elements located on one The side from the main diagonal is zero. For example, the triangular determinant of the fourth order looks like this: Theorem The triangular determinant is equal to the product of the elements standing on the main diagonal. This method is to use the properties of determinant, turn the original determinant into triangular and calculate it Value by theorem. Example Calculate the determinant The method of"
        },
        {
            "text": "reduction determinant to a triangular appearance.  We subtract from the fourth line the third, from the third second, from the second The first, let's get In this determinant we will subtract from the fourth line the third, and from the third line The second, we will have In this determinant from the fourth line we will subtract the third, we will have"
        }
    ]
}